In [37]:
import numpy as np
import pandas as pd

In [38]:
df=pd.read_csv("student_marks.csv")
print(df)

   roll_no    name  maths  physics  chemistry  attendance
0      101   Rahul   78.0     85.0       69.0          92
1      102   Anita   88.0     79.0       91.0          95
2      103    Aman    NaN     65.0       70.0          80
3      104   Pooja   56.0     60.0       58.0          75
4      105   Rohit   90.0     92.0       89.0          98
5      106    Neha   72.0      NaN       68.0          85
6      107   Arjun   45.0     50.0       48.0          60
7      108  Kavita   81.0     77.0        NaN          88
8      109  Suresh   66.0     70.0       72.0          82
9      110   Meena   95.0     93.0       97.0          99

In [39]:
df.head()

   roll_no   name  maths  physics  chemistry  attendance
0      101  Rahul   78.0     85.0       69.0          92
1      102  Anita   88.0     79.0       91.0          95
2      103   Aman    NaN     65.0       70.0          80
3      104  Pooja   56.0     60.0       58.0          75
4      105  Rohit   90.0     92.0       89.0          98

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   roll_no     10 non-null     int64
 1   name        10 non-null     object
 2   maths       9 non-null      float64
 3   physics     9 non-null      float64
 4   chemistry   9 non-null      float64
 5   attendance  10 non-null     int64
dtypes: float64(3), int64(2), object(1)
memory usage: 612.0+ bytes

In [41]:
df.isnull()

   roll_no   name  maths  physics  chemistry  attendance
0    False  False  False    False      False       False
1    False  False  False    False      False       False
2    False  False   True    False      False       False
3    False  False  False    False      False       False
4    False  False  False    False      False       False
5    False  False  False     True      False       False
6    False  False  False    False      False       False
7    False  False  False    False       True       False
8    False  False  False    False      False       False
9    False  False  False    False      False       False

In [42]:
df.isnull().sum()

roll_no       0
name          0
maths         1
physics       1
chemistry     1
attendance    0
dtype: int64

In [49]:
df

   roll_no    name  maths  physics  chemistry  attendance
0      101   Rahul   78.0     85.0  69.000000          92
1      102   Anita   88.0     79.0  91.000000          95
2      103    Aman    NaN     65.0  70.000000          80
3      104   Pooja   56.0     60.0  58.000000          75
4      105   Rohit   90.0     92.0  89.000000          98
5      106    Neha   72.0      NaN  68.000000          85
6      107   Arjun   45.0     50.0  48.000000          60
7      108  Kavita   81.0     77.0  73.555556          88
8      109  Suresh   66.0     70.0  72.000000          82
9      110   Meena   95.0     93.0  97.000000          99

In [50]:
df[["maths","physics","chemistry"]] = df[["maths","physics","chemistry"]].fillna(
    df[["maths","physics","chemistry"]].mean()
)

In [51]:
df

   roll_no    name      maths    physics  chemistry  attendance
0      101   Rahul  78.000000  85.000000  69.000000          92
1      102   Anita  88.000000  79.000000  91.000000          95
2      103    Aman  74.555556  65.000000  70.000000          80
3      104   Pooja  56.000000  60.000000  58.000000          75
4      105   Rohit  90.000000  92.000000  89.000000          98
5      106    Neha  72.000000  74.555556  68.000000          85
6      107   Arjun  45.000000  50.000000  48.000000          60
7      108  Kavita  81.000000  77.000000  73.555556          88
8      109  Suresh  66.000000  70.000000  72.000000          82
9      110   Meena  95.000000  93.000000  97.000000          99

In [60]:
def total_marks(row):
    return row["maths"]+row["physics"]+row["chemistry"]

In [62]:
df["total_marks"]=df.apply(total_marks,axis=1)

In [63]:
df

   roll_no    name      maths    physics  chemistry  attendance  total_marks
0      101   Rahul  78.000000  85.000000  69.000000          92   232.000000
1      102   Anita  88.000000  79.000000  91.000000          95   258.000000
2      103    Aman  74.555556  65.000000  70.000000          80   209.555556
3      104   Pooja  56.000000  60.000000  58.000000          75   174.000000
4      105   Rohit  90.000000  92.000000  89.000000          98   271.000000
5      106    Neha  72.000000  74.555556  68.000000          85   214.555556
6      107   Arjun  45.000000  50.000000  48.000000          60   143.000000
7      108  Kavita  81.000000  77.000000  73.555556          88   231.555556
8      109  Suresh  66.000000  70.000000  72.000000          82   208.000000
9      110   Meena  95.000000  93.000000  97.000000          99   285.000000

In [64]:
df=df.round({
    "maths":2,
    "physics":2,
    "chemistry":2,
    "total_marks":2
})

In [65]:
df

   roll_no    name  maths  physics  chemistry  attendance  total_marks
0      101   Rahul  78.00    85.00      69.00          92       232.00
1      102   Anita  88.00    79.00      91.00          95       258.00
2      103    Aman  74.56    65.00      70.00          80       209.56
3      104   Pooja  56.00    60.00      58.00          75       174.00
4      105   Rohit  90.00    92.00      89.00          98       271.00
5      106    Neha  72.00    74.56      68.00          85       214.56
6      107   Arjun  45.00    50.00      48.00          60       143.00
7      108  Kavita  81.00    77.00      73.56          88       231.56
8      109  Suresh  66.00    70.00      72.00          82       208.00
9      110   Meena  95.00    93.00      97.00          99       285.00

In [66]:
def percentage(row):
    return row["total_marks"]/300 *100

In [69]:
df["percentage"]=df.apply(percentage,axis=1)

In [70]:
df

,roll_no,name,maths,physics,chemistry,attendance,total_marks,percentage
0,101,Rahul,78.00,85.00,69.00,92,232.00,77.333333
1,102,Anita,88.00,79.00,91.00,95,258.00,86.000000
2,103,Aman,74.56,65.00,70.00,80,209.56,69.853333
3,104,Pooja,56.00,60.00,58.00,75,174.00,58.000000
4,105,Rohit,90.00,92.00,89.00,98,271.00,90.333333
5,106,Neha,72.00,74.56,68.00,85,214.56,71.520000
6,107,Arjun,45.00,50.00,48.00,60,143.00,47.666667
7,108,Kavita,81.00,77.00,73.56,88,231.56,77.186667
8,109,Suresh,66.00,70.00,72.00,82,208.00,69.333333
9,110,Meena,95.00,93.00,97.00,99,285.00,95.000000

In [74]:
df=df.round({"percentage":2})

In [75]:
df

,roll_no,name,maths,physics,chemistry,attendance,total_marks,percentage
0,101,Rahul,78.00,85.00,69.00,92,232.00,77.33
1,102,Anita,88.00,79.00,91.00,95,258.00,86.00
2,103,Aman,74.56,65.00,70.00,80,209.56,69.85
3,104,Pooja,56.00,60.00,58.00,75,174.00,58.00
4,105,Rohit,90.00,92.00,89.00,98,271.00,90.33
5,106,Neha,72.00,74.56,68.00,85,214.56,71.52
6,107,Arjun,45.00,50.00,48.00,60,143.00,47.67
7,108,Kavita,81.00,77.00,73.56,88,231.56,77.19
8,109,Suresh,66.00,70.00,72.00,82,208.00,69.33
9,110,Meena,95.00,93.00,97.00,99,285.00,95.00

FIND TOPPER ?

In [97]:
def get_topper(df):
    return df.loc[df["percentage"].idxmax()]
topper=get_topper(df)
print(f"Topper Name : {topper["name"]},\nPercentage :{topper["percentage"]}")

Topper Name : Meena,
Percentage :95.0

FAILED STUDENT ?

In [101]:
failed_students=df[
    (df["maths"]<50) |
    (df["chemistry"]<50) |
    (df["physics"]<50)
]
print(failed_students)

   roll_no   name  maths  physics  chemistry  attendance  total_marks  \
6      107  Arjun   45.0     50.0       48.0          60        143.0

   percentage
6       47.67

AVERAGE MARKS PER SUBJECT

In [105]:
average_marks=df[["maths","physics","chemistry"]].mean()
print(average_marks.round(2))

maths        74.56
physics      74.56
chemistry    73.56
dtype: float64

NUMPY: CONVERT MARKS INTO NUMPY ARRAYS

In [106]:
marks_array = df[["maths","physics","chemistry"]].to_numpy()
print(marks_array)

[[78.   85.   69.  ]
 [88.   79.   91.  ]
 [74.56 65.   70.  ]
 [56.   60.   58.  ]
 [90.   92.   89.  ]
 [72.   74.56 68.  ]
 [45.   50.   48.  ]
 [81.   77.   73.56]
 [66.   70.   72.  ]
 [95.   93.   97.  ]]

In [110]:
np.mean(marks_array,axis=0)

array([74.556, 74.556, 73.556])

In [112]:
np.max(marks_array,axis=0)

array([95., 93., 97.])

In [117]:
np.min(marks_array,axis=0)

array([45., 50., 48.])

In [118]:
np.std(marks_array,axis=0)      # standard deviation

array([14.79264087, 13.06224422, 14.33255818])

In [120]:
df.to_csv("student_marks_cleaned.csv",index=False)